In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
stations = pd.read_csv('Data/stations.csv')
stations.head()

,id,name,geometry,buildstart,opening,closure,city_id
0,7694,Keisei Tsudanuma,POINT(140.024812197129 35.6837744784723),1921.0,1921.0,999999.0,114
1,6003,Kossuth Lajos tér,POINT(19.0462376564033 47.5054880717671),0.0,0.0,999999.0,29
2,7732,Saint-Charles,POINT(5.3801556 43.3024646),1973.0,1977.0,999999.0,74
3,7695,Keisei Makuhari-Hongo,POINT(140.042146725175 35.6726021159981),1991.0,1991.0,999999.0,114
4,7726,Chartreux,POINT(5.4014815 43.309129),1973.0,1977.0,999999.0,74

In [5]:
stations["name"].isnull().sum()

np.int64(1546)

In [6]:
station_lines = pd.read_csv('Data/station_lines.csv')
station_lines.head()

   id  station_id  line_id  city_id           created_at           updated_at
0  47        7754      570       74  2017-11-21 00:00:00  2017-11-21 00:00:00
1  48        7771      571       74  2017-11-21 00:00:00  2017-11-21 00:00:00
2  49        7764      571       74  2017-11-21 00:00:00  2017-11-21 00:00:00
3  50        7763      571       74  2017-11-21 00:00:00  2017-11-21 00:00:00
4  51        7729      571       74  2017-11-21 00:00:00  2017-11-21 00:00:00

In [7]:
lines = pd.read_csv('Data/lines.csv')
lines.head()

,id,city_id,name,url_name,color,system_id,transport_mode_id
0,43,4,Línea 2,43-linea-2,#ffbe2e,267,4.0
1,75,34,Línea 3 Metro de Caracas,75-linea-3-metro-de-caracas,#000,119,NaN
2,107,126,Línea 1,107-linea-1,#434343,249,NaN
3,604,74,La navette,604-la-navette,#009ab9,346,NaN
4,61,66,Línea 1 (Tramo 1A),61-linea-1,#49aa43,250,NaN

In [8]:
cities = pd.read_csv('Data/cities.csv')
cities.head()

,id,name,coords,start_year,url_name,country,country_state
0,5,Aberdeen,POINT(-2.15 57.15),2017.0,aberdeen,Scotland,NaN
1,6,Adelaide,POINT(138.6 -34.91666667),2017.0,adelaide,Australia,NaN
2,7,Algiers,POINT(3 36.83333333),2017.0,algiers,Algeria,NaN
3,9,Ankara,POINT(32.91666667 39.91666667),2017.0,ankara,Turkey,NaN
4,16,Belém,POINT(-48.48333333 -1.466666667),2017.0,belem,Brazil,NaN